Scipts/UC1_Buy/result1/Iteration5/t24.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>amhabyjfr</ns2:safePayUsername><ns2:safePayPassword>efb01c5808b049ce24a3df077d2d2a84b2e85070</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>